cases/validation_2d/template/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
|  fvSchemes -- Phase-1 clean-section 2D validation case                      |
|  Instantiated from cases/validation_2d/template by                          |
|  scripts/build_validation_case.py                                           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    // Steady SIMPLE. (pimpleFoam fallback swaps this single entry for
    // localEuler -- see the case README for the full delta set.)
    default         steadyState;
}

gradSchemes
{
    // cellLimited keeps reconstruction monotone in the few skewed cells the
    // transfinite C-blocks produce around the nose, without degrading the
    // second-order behaviour over the (near-orthogonal) BL region.
    default         cellLimited Gauss linear 1;
    grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    // No silent defaults: every transported quantity is listed so a model
    // change cannot pick up an unintended scheme.
    default         none;

    // Momentum: second-order upwind-biased -- the standard accuracy/
    // robustness point for steady external aero polars.
    div(phi,U)      bounded Gauss linearUpwind grad(U);

    // Turbulence + transition scalars: limitedLinear (2nd order, TVD-
    // limited) rather than plain upwind. Transition location is the
    // quantity this whole phase is validated on, and first-order smearing
    // of gammaInt/ReThetat shifts it; the limiter supplies the necessary
    // boundedness near the transition front instead.
    div(phi,k)        bounded Gauss limitedLinear 1;
    div(phi,omega)    bounded Gauss limitedLinear 1;
    div(phi,gammaInt) bounded Gauss limitedLinear 1;
    div(phi,ReThetat) bounded Gauss limitedLinear 1;

    // Viscous stress divergence term assembled by the solver.
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    // 'corrected' = explicit non-orthogonal correction; the C-grid is close
    // to orthogonal in the BL but earns its correction near the nose cut
    // and the blunt-base corner blocks.
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    // kOmegaSSTLM needs wall distance (both SST blending and the transition
    // correlations); meshWave is exact enough on a body-fitted single-wall
    // domain and costs one sweep at startup.
    method          meshWave;
}

// ************************************************************************* //
